fio4pi/results/6405-4w-rpi3-raspbian_v4.1.19-v7+.log
random-write-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-4: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 4 processes
random-write-3: Laying out IO file(s) (1 file(s) / 1024MB)
random-write-4: Laying out IO file(s) (1 file(s) / 1024MB)

random-write-1: (groupid=0, jobs=1): err= 0: pid=986: Wed Mar 16 02:58:08 2016
  write: io=1024.0MB, bw=256425B/s, iops=62, runt=4187351msec
    clat (usec): min=14, max=8751.9K, avg=15963.55, stdev=154710.79
     lat (usec): min=15, max=8751.9K, avg=15964.66, stdev=154710.80
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   18], 10.00th=[   19], 20.00th=[   19],
     | 30.00th=[   19], 40.00th=[   20], 50.00th=[   20], 60.00th=[   21],
     | 70.00th=[   22], 80.00th=[   23], 90.00th=[   38], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1171456], 99.95th=[4227072],
     | 99.99th=[6979584]
    bw (KB  /s): min=    0, max=31527, per=33.15%, avg=327.20, stdev=452.80
    lat (usec) : 20=30.35%, 50=61.92%, 100=1.69%, 250=0.03%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.04%, 10=0.02%, 20=0.02%, 50=0.03%
    lat (msec) : 100=0.03%, 250=5.74%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.02%, >=2000=0.09%
  cpu          : usr=0.04%, sys=0.17%, ctx=16335, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-2: (groupid=0, jobs=1): err= 0: pid=987: Wed Mar 16 02:58:08 2016
  write: io=1024.0MB, bw=255717B/s, iops=62, runt=4198943msec
    clat (usec): min=14, max=8624.1K, avg=16007.73, stdev=155543.09
     lat (usec): min=15, max=8624.1K, avg=16008.86, stdev=155543.10
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   17], 10.00th=[   18], 20.00th=[   19],
     | 30.00th=[   19], 40.00th=[   20], 50.00th=[   20], 60.00th=[   20],
     | 70.00th=[   21], 80.00th=[   23], 90.00th=[   38], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1171456], 99.95th=[4292608],
     | 99.99th=[7045120]
    bw (KB  /s): min=    0, max=20338, per=33.10%, avg=326.72, stdev=312.08
    lat (usec) : 20=37.61%, 50=54.66%, 100=1.68%, 250=0.02%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.03%, 10=0.02%, 20=0.02%, 50=0.03%
    lat (msec) : 100=0.03%, 250=5.75%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.02%, >=2000=0.08%
  cpu          : usr=0.05%, sys=0.15%, ctx=16297, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-3: (groupid=0, jobs=1): err= 0: pid=988: Wed Mar 16 02:58:08 2016
  write: io=1024.0MB, bw=252895B/s, iops=61, runt=4245794msec
    clat (usec): min=11, max=8642.7K, avg=16186.36, stdev=156787.05
     lat (usec): min=12, max=8642.7K, avg=16187.56, stdev=156787.06
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   14], 10.00th=[   14], 20.00th=[   18],
     | 30.00th=[   19], 40.00th=[   20], 50.00th=[   21], 60.00th=[   21],
     | 70.00th=[   23], 80.00th=[   35], 90.00th=[ 5216], 95.00th=[97792],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1056768], 99.95th=[4292608],
     | 99.99th=[7110656]
    bw (KB  /s): min=    0, max=65195, per=33.14%, avg=327.12, stdev=926.29
    lat (usec) : 20=31.16%, 50=51.96%, 100=2.65%, 250=0.62%, 500=0.05%
    lat (usec) : 750=0.02%, 1000=0.02%
    lat (msec) : 2=0.10%, 4=2.40%, 10=2.32%, 20=1.22%, 50=1.70%
    lat (msec) : 100=0.81%, 250=4.57%, 500=0.18%, 750=0.11%, 1000=0.02%
    lat (msec) : 2000=0.02%, >=2000=0.08%
  cpu          : usr=0.06%, sys=0.15%, ctx=43778, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-4: (groupid=0, jobs=1): err= 0: pid=989: Wed Mar 16 02:58:08 2016
  write: io=1024.0MB, bw=256842B/s, iops=62, runt=4180540msec
    clat (usec): min=11, max=8364.8K, avg=15937.56, stdev=154974.38
     lat (usec): min=12, max=8364.8K, avg=15938.69, stdev=154974.40
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   14], 10.00th=[   15], 20.00th=[   19],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   21], 60.00th=[   21],
     | 70.00th=[   23], 80.00th=[   30], 90.00th=[ 4704], 95.00th=[113152],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[774144], 99.95th=[4358144],
     | 99.99th=[7045120]
    bw (KB  /s): min=    0, max=70329, per=33.27%, avg=328.36, stdev=978.00
    lat (usec) : 20=27.77%, 50=56.36%, 100=2.42%, 250=0.40%, 500=0.07%
    lat (usec) : 750=0.06%, 1000=0.05%
    lat (msec) : 2=0.21%, 4=2.00%, 10=2.09%, 20=1.12%, 50=1.64%
    lat (msec) : 100=0.74%, 250=4.73%, 500=0.16%, 750=0.08%, 1000=0.01%
    lat (msec) : 2000=0.02%, >=2000=0.08%
  cpu          : usr=0.07%, sys=0.15%, ctx=40535, majf=0, minf=23
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=987KB/s, minb=246KB/s, maxb=250KB/s, mint=4180540msec, maxt=4245794msec

Disk stats (read/write):
  mmcblk0: ios=13/959665, merge=0/17338, ticks=350/299252740, in_queue=299253910, util=100.00%